In [7]:
import pandas as pd

df = pd.read_excel("./../../data/RegionA_online.xlsx")
df.head()

,date,product,discount,amount,Tablet Basic,Tablet Mini,Tablet Pro,kosten_basic,kosten_mini,kosten_pro,transaction_id
0,2021-11-01,Tablet Basic,1.0,5,1,0,0,170.018118,NaN,NaN,22
1,2021-11-01,Tablet Basic,1.0,7,1,0,0,170.019765,NaN,NaN,24
2,2021-11-01,Tablet Basic,0.9,7,1,0,0,210.032941,NaN,NaN,40
3,2021-11-01,Tablet Basic,1.0,10,1,0,0,170.078236,NaN,NaN,95
4,2021-11-01,Tablet Basic,1.0,4,1,0,0,170.085647,NaN,NaN,104